ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
/***************************************************************************//**
* \file cy_syspm.c
* \version 1.0
*
* This driver provides the source code to the API for the power management.
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/
#include "cy_syspm.h"

static cy_stc_syspm_callback_t* callbackRoot = NULL;
static uint32_t currentRegisteredCallbacksNumber = 0u;

static void Cy_SysPm_SetDelayAfterDeepSleep(void);

#if(0u != SRSS_SIMOBUCK_PRESENT)

    static void Cy_SysPm_SetVoltageBitForFlash(bool setBit);

#endif /* (0u != SRSS_SIMOBUCK_PRESENT) */


/*******************************************************************************
* Function Name: Cy_SysPm_ReadStatus
****************************************************************************//**
*
* Reads the status of the core(s).
*
* \return The current power mode. See \ref group_syspm_return_status.
*
*******************************************************************************/
uint32_t Cy_SysPm_ReadStatus(void)
{
    uint32_t interruptState;
    uint32_t pmStatus = 0u;
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check whether CM4 is in DeepSleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM4_STATUS_SLEEPING, CPUSS->CM4_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM4_STATUS_SLEEPDEEP, CPUSS->CM4_STATUS)))
    {
        pmStatus |= CY_SYSPM_STATUS_CM4_DEEPSLEEP;
    }
    /* Check whether CM4 is in Sleep mode*/
    else if(0u != _FLD2VAL(CPUSS_CM4_STATUS_SLEEPING, CPUSS->CM4_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM4_SLEEP;
    }
        else
        {
            pmStatus |= CY_SYSPM_STATUS_CM4_ACTIVE;
        }

    /* Check whether CM0p is in DeepSleep mode*/
    if((0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPING, CPUSS->CM0_STATUS)) &&
       (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPDEEP, CPUSS->CM0_STATUS)))
    {
        pmStatus |= (uint32_t) CY_SYSPM_STATUS_CM0_DEEPSLEEP;
    }
    /* Check whether CM0p is in Sleep mode*/
    else if (0u != _FLD2VAL(CPUSS_CM0_STATUS_SLEEPING, CPUSS->CM0_STATUS))
    {
        pmStatus |= CY_SYSPM_STATUS_CM0_SLEEP;
    }
        else
        {
            pmStatus |= CY_SYSPM_STATUS_CM0_ACTIVE;
        }

    /* Check whether device is in Low Power mode by reading
    *  the Active Reference status
    */
    if(0u != (_FLD2VAL(SRSS_PWR_CTL_ACT_REF_DIS, SRSS->PWR_CTL)))
    {
        pmStatus |= CY_SYSPM_STATUS_SYSTEM_LOWPOWER;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return(pmStatus);
}


/*******************************************************************************
* Function Name: Cy_SysPm_Sleep
****************************************************************************//**
*
* Sets a CPU core to Sleep mode.
*
* Puts the core into the Sleep power mode, if none of callback functions were
* registered.
*
* If at least one callback function with CY_SYSPM_SLEEP type was registered, the
* next algorithm is executed.
* Prior to entering Sleep mode, all callback functions with CY_SYSPM_SLEEP type
* with CY_SYSPM_CHECK_READY parameter are called allowing a driver
* to signal whether it is ready to enter the low power mode. If any of
* callbacks with CY_SYSPM_SLEEP type with CY_SYSPM_CHECK_READY parameter
* returns CY_SYSPM_FAIL the remaining callback with CY_SYSPM_SLEEP type with
* CY_SYSPM_CHECK_READY parameter calls are skipped.
* After a CY_SYSPM_FAIL, all of the CY_SYSPM_SLEEP callbacks with
* CY_SYSPM_CHECK_FAIL parameter are executed that correspond to the callback
* with callbacks with CY_SYSPM_SLEEP type with CY_SYSPM_CHECK_READY
* parameter calls that occurred up to the point of failure. Sleep mode is not
* entered and the Cy_SysPm_Sleep API returns CY_SYSPM_FAIL.
*
* If all of the callbacks with CY_SYSPM_SLEEP type with CY_SYSPM_CHECK_READY
* parameter calls return CY_SYSPM_SUCCESS then all callbacks with CY_SYSPM_SLEEP
* type with CY_SYSPM_CHECK_FAIL parameters calls are skipped and all callbacks
* with CY_SYSPM_SLEEP type and CY_SYSPM_BEFORE_ENTER parameter calls are
* executed, allowing peripherals to prepare for Sleep. Sleep mode is then
* entered for the CPU. This is a CPU-centric power mode. It means that the CPU
* has entered Sleep mode and its main clock is removed. It is identical to
* Active from a peripheral point of view. Any enabled interrupts can cause a
* wakeup from Sleep mode.
*
* After wakeup from Sleep all of the registered callbacks with CY_SYSPM_SLEEP
* type and with CY_SYSPM_AFTER_EXIT parameter are executed to return peripherals
* to Active operation. The Cy_SysPm_Sleep API returns CY_SYSPM_SUCCESS.
* No callbacks with CY_SYSPM_SLEEP type with CY_SYSPM_BEFORE_ENTER parameter or
* callbacks with CY_SYSPM_SLEEP type and CY_SYSPM_AFTER_EXIT parameter callbacks
* are executed if Sleep mode is not entered.
*
* \param enWaitFor Selects wait for action. See \ref cy_en_syspm_waitfor_t.
*
* \return
* CY_SYSPM_SUCCESS - Entered and exited from Sleep <br>
* CY_SYSPM_FAIL - Sleep not entered. See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_Sleep(cy_en_syspm_waitfor_t enWaitFor)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Call registered callback functions with CY_SYSPM_CHECK_READY parameter */
    if(0u != currentRegisteredCallbacksNumber)
    {
        retVal = (cy_en_syspm_status_t) Cy_SysPm_ExecuteCallback(CY_SYSPM_SLEEP, CY_SYSPM_CHECK_READY, 0u);
    }

    /* The device (core) can switch into Sleep power mode only when
    *  all executed registered callback functions with CY_SYSPM_CHECK_READY
    *  parameter returned CY_SYSPM_SUCCESS.
    */
    if(retVal == CY_SYSPM_SUCCESS)
    {
        /* Call registered callback functions with CY_SYSPM_BEFORE_ENTER
        *  parameter. Return value is ignored.
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if(0u != currentRegisteredCallbacksNumber)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_SLEEP, CY_SYSPM_BEFORE_ENTER, 0u);
        }

