ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
        /* CPU enters Sleep power mode upon execution of WFI/WFE */
        SCB->SCR = _CLR_SET_FLD32U((SCB->SCR), SCB_SCR_SLEEPDEEP, 0u);

        if(enWaitFor != CY_SYSPM_WAIT_FOR_EVENT)
        {
            __WFI();
        }
        else
        {
            __WFE();
        }
        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call registered callback functions with CY_SYSPM_AFTER_EXIT
        *  parameter. Return value is ignored.
        */
        if(0u != currentRegisteredCallbacksNumber)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_SLEEP, CY_SYSPM_AFTER_EXIT, 0u);
        }
    }
    else
    {
        /* Execute callback functions with CY_SYSPM_CHECK_FAIL parameter to
        *  undo everything done in the CY_SYSPM_CHECK_READY callback. Return
        * value is ignored.
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_SLEEP, CY_SYSPM_CHECK_FAIL, (uint32_t) retVal);
        retVal = CY_SYSPM_FAIL;
    }
    return retVal;
}


/*******************************************************************************
* Function Name: Cy_SysPm_DeepSleep
****************************************************************************//**
*
* Sets a CPU core to DeepSleep mode.
*
* Puts the core into the Deep Sleep power mode. Prior to entering Deep Sleep
* mode, all callbacks with CY_SYSPM_DEEPSLEEP type with CY_SYSPM_CHECK_READY
* parameter registered callbacks are called, allowing a driver to signal whether
* it is ready to enter the power mode. If any CY_SYSPM_DEEPSLEEP
* type with CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL, the
* remaining callback CY_SYSPM_DEEPSLEEP type with CY_SYSPM_CHECK_READY parameter
* calls are skipped. After a CY_SYSPM_FAIL, all of the callbacks with
* CY_SYSPM_DEEPSLEEP type with CY_SYSPM_CHECK_FAIL parameter are executed that
* correspond to the callbacks with CY_SYSPM_DEEPSLEEP type with
* CY_SYSPM_CHECK_READY parameter calls that occurred up to the point of failure.
* Deep Sleep mode is not entered and the Cy_SysPm_Sleep API returns
* CY_SYSPM_FAIL.
*
* If all callbacks with CY_SYSPM_DEEPSLEEP type with CY_SYSPM_CHECK_READY
* parameter calls return CY_SYSPM_SUCCESS, then all callbacks with
* CY_SYSPM_DEEPSLEEP type with CY_SYSPM_CHECK_FAIL parameter calls are skipped
* and all callbacks with CY_SYSPM_DEEPSLEEP type with CY_SYSPM_BEFORE_ENTER
* parameter calls are executed, allowing peripherals to prepare for Deep Sleep.
* Deep Sleep mode is then entered. Any enabled interrupts can cause a wakeup
* from Deep Sleep mode.
*
* If the firmware attempts to enter this mode before the system is ready (that
* is, when PWR_CONTROL.LPM_READY = 0), then the device will go into the (LP)
* Sleep mode instead and automatically enter the DeepSleep mode when the
* system is ready.
*
* The SRSS puts the whole device into DeepSleep mode when all the processors
* are in SLEEPDEEP, there are no busy peripherals, the debugger is not active,
* and the DEEPSLEEP circuits in the SRSS are ready (PWR_CONTROL.LPM_READY=1).
*
* Peripherals not needing a clock or that receive a clock from their external
* interface (e.g. I2C/SPI) continue operating. All circuits using the current
* from Vccdpslp supply are under the current limitation that is controlled
* by DeepSleep regulator.
*
* Wakeup occurs when an interrupt is received from a DeepSleep active
* peripheral. For more details, see the corresponding peripheral's datasheet.
*
* A normal wakeup from DeepSleep returns to either LPActive, LPSleep, Active, or
* Sleep, depending on the previous state and programmed behaviour for the
* particular wakeup interrupt.
*
* After wakeup from Deep Sleep, all of the registered callbacks with
* CY_SYSPM_DEEPSLEEP type with CY_SYSPM_AFTER_EXIT are executed to return
* peripherals to Active operation. The Cy_SysPm_DeepSleep API returns
* CY_SYSPM_SUCCESS. No callbacks are executed with CY_SYSPM_DEEPSLEEP type with
* CY_SYSPM_BEFORE_ENTER or CY_SYSPM_AFTER_EXIT parameter, if Deep Sleep
* mode is not entered.
*
* \param enWaitFor Selects wait for action. See \ref cy_en_syspm_waitfor_t.
*
* \return
* CY_SYSPM_SUCCESS - Entered and exited from DeepSleep <br>
* CY_SYSPM_FAIL - DeepSleep not entered. See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_DeepSleep(cy_en_syspm_waitfor_t enWaitFor)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Call registered callback functions with CY_SYSPM_CHECK_READY parameter */
    if(0u != currentRegisteredCallbacksNumber)
    {
        retVal = (cy_en_syspm_status_t) Cy_SysPm_ExecuteCallback(CY_SYSPM_DEEPSLEEP, CY_SYSPM_CHECK_READY, 0u);
    }

    /* The device (core) can switch into Deep Sleep power mode only when
    *  all executed registered callback functions with CY_SYSPM_CHECK_READY
    *  parameter returned CY_SYSPM_SUCCESS.
    */
    if(retVal == CY_SYSPM_SUCCESS)
    {
        /* Call registered callback functions with CY_SYSPM_BEFORE_ENTER
        * parameter. Return value is ignored.
        */
        interruptState = Cy_SysLib_EnterCriticalSection();
        if(0u != currentRegisteredCallbacksNumber)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_DEEPSLEEP, CY_SYSPM_BEFORE_ENTER, 0u);
        }
        Cy_SysPm_SetDelayAfterDeepSleep();

        /* CPU enters DeepSleep mode upon execution of WFI/WFE */
        SCB->SCR = _CLR_SET_FLD32U((SCB->SCR), SCB_SCR_SLEEPDEEP, 1u);

        if(enWaitFor != CY_SYSPM_WAIT_FOR_EVENT)
        {
            __WFI();
        }
        else
        {
            __WFE();
        }
        Cy_SysLib_ExitCriticalSection(interruptState);

        /* Call registered callback functions with CY_SYSPM_AFTER_EXIT
        *  parameter. Return value is ignored.
        */
        if(0u != currentRegisteredCallbacksNumber)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_DEEPSLEEP, CY_SYSPM_AFTER_EXIT, 0u);
        }
    }
    else
    {
        /* Execute callbacks functions with CY_SYSPM_CHECK_FAIL parameter to
        *  undo everything done in the CY_SYSPM_CHECK_READY callback. Return
        *  value is ignored.
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_DEEPSLEEP, CY_SYSPM_CHECK_FAIL, (uint32_t) retVal);
        retVal = CY_SYSPM_FAIL;
    }
    return retVal;
}


