ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
/*******************************************************************************
* Function Name: Cy_SysPm_Hibernate
****************************************************************************//**
*
* Sets the device into Hibernate mode.
*
* Puts the core into the Hibernate power mode. Prior to entering Hibernate mode
* all callbacks with CY_SYSPM_HIBERNATE type are executed.
* At the first time callbacks with CY_SYSPM_HIBERNATE type and with
* CY_SYSPM_CHECK_READY parameter are called allowing a driver to signal it is
* not ready to enter the power mode. If any of callbacks CY_SYSPM_HIBERNATE type
* with CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL the
* remaining CY_SYSPM_HIBERNATE callbacks with CY_SYSPM_CHECK_READY parameter
* calls are skipped. After a CY_SYSPM_FAIL all of the CY_SYSPM_HIBERNATE
* callbacks with CY_SYSPM_CHECK_FAIL parameter are executed that correspond to
* the CY_SYSPM_HIBERNATE callbacks with CY_SYSPM_CHECK_READY parameter calls
* that occurred up to the point of failure. Hibernate mode is not entered
* and the Cy_SysPm_Hibernate API returns CY_SYSPM_FAIL.
*
* If all CY_SYSPM_HIBERNATE callbacks with CY_SYSPM_CHECK_READY parameter calls
* return CY_SYSPM_SUCCESS, then all CY_SYSPM_HIBERNATE callbacks with
* CY_SYSPM_CHECK_FAIL calls are skipped and all CY_SYSPM_HIBERNATE callbacks
* CY_SYSPM_BEFORE_ENTER parameter calls are executed allowing peripherals to
* prepare for Hibernate. I/O output state is frozen and Hibernate mode is then
* entered. In Hibernate mode all internal supplies are off and no internal state
* is retained. There is no handshake with the CPUs and the chip will begin entry
* to Hibernate immediately.
*
* A wakeup from Hibernate is triggered by toggling the wakeup pin(s), a WDT
* match, or back up domain alarm expiration depending on how the HIBERNATE
* register is configured. A wakeup causes a normal boot procedure to occur.
* To configure the wakeup pin(s), a Digital Input Pin must be configured, and
* resistively pulled up or down to the inverse state of the wakeup polarity. To
* distinguish a wakeup from the Hibernate mode and a general reset event,
* Cy_SysLib_GetResetReason() function can be used. The wakeup pin is
* active-low by default. The wakeup pin polarity can be changed with the
* \ref Cy_SysPm_WakeupPinLevel() function. This function call will not return if
* Hibernate mode is entered. The CY_SYSPM_HIBERNATE callbacks with
* CY_SYSPM_AFTER_EXIT parameter are never executed.
*
* This function freezes IO cells implicitly. It is not possible to enter
* the Hibernate mode before freezing the IO cells. The IO cells remain frozen
* after waking from Hibernate mode until firmware unfreezes them
* with a \ref Cy_SysPm_IoUnfreeze() function call.
*
* \return
* CY_SYSPM_SUCCESS - Not valid as hibernate; can only exit through a reset. <br>
* CY_SYSPM_FAIL - Hibernate not entered. See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_Hibernate(void)
{
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Call registered callback functions with CY_SYSPM_CHECK_READY parameter */
    if(0u != currentRegisteredCallbacksNumber)
    {
        retVal = (cy_en_syspm_status_t) Cy_SysPm_ExecuteCallback(CY_SYSPM_HIBERNATE, CY_SYSPM_CHECK_READY, 0u);
    }

    /* The device (core) can switch into Hibernate power mode only when
    *  all executed registered callback functions with CY_SYSPM_CHECK_READY
    *  parameter returned CY_SYSPM_SUCCESS.
    */
    if(retVal == CY_SYSPM_SUCCESS)
    {
        /* Call registered callback functions with CY_SYSPM_BEFORE_ENTER
        *  parameter. Return value is ignored.
        */
        (void) Cy_SysLib_EnterCriticalSection();
        if(0u != currentRegisteredCallbacksNumber)
        {
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HIBERNATE, CY_SYSPM_BEFORE_ENTER, 0u);
        }

        /* Safe retain bit-fields before entering into Hibernate power mode. */
        SRSS->PWR_HIBERNATE &= CY_SYSPM_PWR_RETAIN_HIBERNATE_STATUS;

        /* All three writes to HIBERNATE register use same value:
        *  PWR_HIBERNATE.FREEZE=1, .UNLOCK=0x3A, .HIBERANTE=1,
        */
        SRSS->PWR_HIBERNATE |=  CY_SYSPM_PWR_HIBERNATE_UNLOCK |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_FREEZE, 1u) |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_HIBERNATE, 1u);

        SRSS->PWR_HIBERNATE |=  CY_SYSPM_PWR_HIBERNATE_UNLOCK |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_FREEZE, 1u) |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_HIBERNATE, 1u);

        SRSS->PWR_HIBERNATE |=  CY_SYSPM_PWR_HIBERNATE_UNLOCK |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_FREEZE, 1u) |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_HIBERNATE, 1u);

        /* Wait for transition */
        __WFI();

        /* The callback functions calls with CY_SYSPM_AFTER_EXIT parameter in
        *  Hibernate power mode is is not applicable as device wake-up is made
        *  on device reboot.
        */

        /* A wakeup from Hibernate is performed by toggling of wakeup pins, or
        *  WDT matches, or Backup domain alarm expires. Depends on what item is
        *  configured in HIBERNATE register. After a wakeup event, a normal Boot
        *  procedure occurs. No need to exit from the critical section.
        */
    }
    else
    {
        /* Execute callback functions with CY_SYSPM_CHECK_FAIL parameter to
        *  undo everything done in the CY_SYSPM_CHECK_READY callback. Return
        *  value is ignored.
        */
        (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_HIBERNATE, CY_SYSPM_CHECK_FAIL, (uint32_t) retVal);
        retVal = CY_SYSPM_FAIL;
    }
    return retVal;
}


/*******************************************************************************
* Function Name: Cy_SysPm_EnterLpMode
****************************************************************************//**
*
* Sets device into Low Power mode.
*
* The low power (LPActive/LPSleep) modes are similar to the Active/Sleep modes.
* The difference is that the current is limited and some functions have limited
* features/performance.
*
* The feature of the low power mode is limited current. Restrictions are placed
* on the clock frequencies and allowed peripherals to achieve current limit.
*
* Before entering low power mode, the user should configure the system so the total
* current drawn from Vccd is less that value presented in the technical
* reference manual (TRM). Refer to TRM for the maximum load for low power
* operation and clock limitations in low power mode with different core supply
* regulator voltages.
*
* * Peripherals can use the knowledge of LPActive/LPSleep mode to make
* trade-offs that consume less current. For more details, see the corresponding
* peripheral's datasheet.
* * High-speed clock sources are available with appropriate predivider settings
* to limit the system current.
* Refer to the TRM for the maximum frequency values for low power operation using
* different Core Regulators output voltages.
*
* Puts the device into the Low Power mode. Prior to entering Low Power mode, all
* registered CY_SYSPM_ENTER_LP_MODE callbacks with CY_SYSPM_CHECK_READY
* parameter are called. This allows a driver to signal it is not ready to enter the
* Low Power mode. If any CY_SYSPM_ENTER_LP_MODE callbacks with
* CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL the remaining
* CY_SYSPM_ENTER_LP_MODE callbacks with CY_SYSPM_CHECK_READY parameter calls are
* skipped.
* After a CY_SYSPM_FAIL all of the CY_SYSPM_ENTER_LP_MODE callbacks with
* CY_SYSPM_CHECK_FAIL parameter are executed that correspond to the
* CY_SYSPM_ENTER_LP_MODE callbacks with CY_SYSPM_CHECK_READY parameter calls
* that occurred up to the point of failure. Low Power mode is not entered and
* the Cy_SysPm_EnterLpMode API returns CY_SYSPM_FAIL.
*
* If all CY_SYSPM_ENTER_LP_MODE callbacks with CY_SYSPM_CHECK_READY parameter
* calls return CY_SYSPM_SUCCESS then all CY_SYSPM_ENTER_LP_MODE callbacks with
* CY_SYSPM_CHECK_FAIL calls are skipped and all CY_SYSPM_ENTER_LP_MODE callbacks
* with CY_SYSPM_BEFORE_ENTER parameter calls are executed. This allows peripherals
* to prepare for Low Power. Low Power mode is then entered.
*
* After entering Low Power mode, all of the registered CY_SYSPM_ENTER_LP_MODE
* callbacks with CY_SYSPM_AFTER_EXIT parameter are executed to complete
* preparing peripherals for Low Power operation. The Cy_SysPm_EnterLpMode API
* returns CY_SYSPM_SUCCESS. No CY_SYSPM_ENTER_LP_MODE callbacks with
* CY_SYSPM_BEFORE_ENTER or CY_SYSPM_AFTER_EXIT parameter are executed, if Low
* Power mode is not entered.
*
* \note The callbacks are not executed if device already is not in low power
* mode.
*
* \return
* CY_SYSPM_SUCCESS - Entered LPActive mode or device is already in LPActive. <br>
* CY_SYSPM_FAIL - LPActive mode not entered or low power circuits are not ready
* to enter into low power mode. See \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_EnterLpMode(void)
{
    uint32_t interruptState;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

