ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
    /* Check whether device is in Low Power mode */
    if(0u == (_FLD2VAL(SRSS_PWR_CTL_ACT_REF_DIS, SRSS->PWR_CTL)))
    {
        /* The entering into low power mode is permitted when low
        *  power circuits are ready to enter into low power mode.
        */
        if(0u != _FLD2VAL(SRSS_PWR_CTL_LPM_READY, SRSS->PWR_CTL))
        {
            /* Call registered callback functions with CY_SYSPM_CHECK_READY parameter */
            if(0u != currentRegisteredCallbacksNumber)
            {
                retVal = (cy_en_syspm_status_t) Cy_SysPm_ExecuteCallback(CY_SYSPM_ENTER_LP_MODE, CY_SYSPM_CHECK_READY, 0u);
            }

            /* The device (core) can switch into Low power mode only when
            *  all executed registered callback functions with CY_SYSPM_CHECK_READY
            *  parameter returned CY_SYSPM_SUCCESS.
            */
            if(retVal == CY_SYSPM_SUCCESS)
            {

                /* Call registered callback functions with CY_SYSPM_BEFORE_ENTER
                *  parameter. Return value is ignored.
                */
                interruptState = Cy_SysLib_EnterCriticalSection();
                if(0u != currentRegisteredCallbacksNumber)
                {
                    (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ENTER_LP_MODE, CY_SYSPM_BEFORE_ENTER, 0u);
                }
                /* Configure low-power operating mode for Linear Core regulator */
                if(Cy_SysPm_LdoIsEnabled())
                {
                    SRSS->PWR_CTL |= (_VAL2FLD(SRSS_PWR_CTL_LINREG_LPMODE, 1u) |
                                      _VAL2FLD(SRSS_PWR_CTL_PORBOD_LPMODE, 1u) |
                                      _VAL2FLD(SRSS_PWR_CTL_BGREF_LPMODE, 1u));
                }
                else
                {
                    /* Configure low-power operating mode for SIMO Buck regulator */
                    SRSS->PWR_CTL |= (_VAL2FLD(SRSS_PWR_CTL_PORBOD_LPMODE, 1u) |
                                      _VAL2FLD(SRSS_PWR_CTL_BGREF_LPMODE, 1u));
                }

                /* This wait time allows the circuits to remove their dependence on
                *  Active mode circuits, such as the Active Reference
                */
                Cy_SysLib_DelayUs(CY_SYSPM_PWR_ACTIVE_TO_LP_WAIT_US);

                /* Disabling active reference */
                SRSS->PWR_CTL |= _VAL2FLD(SRSS_PWR_CTL_ACT_REF_DIS, 1u);

                Cy_SysLib_ExitCriticalSection(interruptState);

                /* Call registered callback functions with CY_SYSPM_AFTER_EXIT
                *  parameter. Return value is ignored.
                */
                if(0u != currentRegisteredCallbacksNumber)
                {
                    (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ENTER_LP_MODE, CY_SYSPM_AFTER_EXIT, 0u);
                }
            }
            else
            {
                /* Execute callbacks functions with CY_SYSPM_CHECK_FAIL parameter to
                *  undo everything done in the CY_SYSPM_CHECK_READY callback. Return
                *  value is ignored.
                */
                (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_ENTER_LP_MODE, CY_SYSPM_CHECK_FAIL, (uint32_t) retVal);
                retVal = CY_SYSPM_FAIL;
            }
        }
        else
        {
            retVal = CY_SYSPM_FAIL;
        }
    }
    else
    {
        /* Do nothing as device is already in low-power mode. */
    }
    return retVal;
}


/*******************************************************************************
* Function Name: Cy_SysPm_ExitLpMode
****************************************************************************//**
*
* Sets device out of Low Power mode.
*
* Returns device to the Active mode. In active power mode, operating current can
* be increased to the normal mode limit. Clock frequencies also can be increased
* to the normal mode limit. Refer to the device TRM for current and frequency
* limitations in Active power mode.
*
* Prior to exiting Low Power mode, all registered CY_SYSPM_EXIT_LP_MODE callbacks
* with CY_SYSPM_CHECK_READY parameter are called. This allows
* a driver to signal it is not ready to exit the
* Low Power mode. If any CY_SYSPM_EXIT_LP_MODE callbacks with
* CY_SYSPM_CHECK_READY parameter call returns CY_SYSPM_FAIL, the remaining
* CY_SYSPM_EXIT_LP_MODE callbacks with CY_SYSPM_CHECK_READY parameter calls are
* skipped. After a CY_SYSPM_FAIL, all of the CY_SYSPM_EXIT_LP_MODE callbacks with
* CY_SYSPM_CHECK_FAIL parameter are executed that correspond to the
* CY_SYSPM_EXIT_LP_MODE callbacks with CY_SYSPM_CHECK_READY parameter calls that
* occurred up to the point of failure. Active mode is not entered and the
* Cy_SysPm_ExitLpMode API returns CY_SYSPM_FAIL.
*
* If all CY_SYSPM_EXIT_LP_MODE callbacks with CY_SYSPM_CHECK_READY calls return
* CY_SYSPM_SUCCESS then all CY_SYSPM_EXIT_LP_MODE callbacks with
* CY_SYSPM_CHECK_FAIL parameter calls are skipped and all CY_SYSPM_EXIT_LP_MODE
* callbacks CY_SYSPM_BEFORE_ENTER parameter calls are executed allowing
* peripherals to prepare for Active mode. Low Power mode is then exited.
*
* After exiting Low Power mode all of the registered callbacks are executed
* CY_SYSPM_EXIT_LP_MODE callbacks with CY_SYSPM_AFTER_EXIT parameter to complete
* preparing peripherals for Active mode operation. The Cy_SysPm_ExitLpMode API
* returns CY_SYSPM_SUCCESS. No CY_SYSPM_EXIT_LP_MODE callbacks with
* CY_SYSPM_BEFORE_ENTER or CY_SYSPM_AFTER_EXIT parameter are executed if Low
* Power mode is not exited.
*
* \note The callbacks are not executed if device is already not in a low power
* mode.
*
* \return
* CY_SYSPM_SUCCESS - Exited from LPActive power mode, or device is already in
* Active power. <br>
* CY_SYSPM_FAIL - the exit from LPActive mode not done,
* see \ref cy_en_syspm_status_t.
*
* \warning This function blocks as it waits until Active Reference is ready
* to enter into normal mode.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_ExitLpMode(void)
{
    uint32_t interruptState;
    uint32_t timeOut = CY_SYSPM_WAIT_DELAY_TRYES;
    cy_en_syspm_status_t retVal = CY_SYSPM_SUCCESS;

    /* Check if device is in Low Power mode */
    if(0u != (_FLD2VAL(SRSS_PWR_CTL_ACT_REF_DIS, SRSS->PWR_CTL)))
    {
        /* Call registered callback functions with CY_SYSPM_CHECK_READY parameter */
        if(0u != currentRegisteredCallbacksNumber)
        {
            retVal = (cy_en_syspm_status_t) Cy_SysPm_ExecuteCallback(CY_SYSPM_EXIT_LP_MODE, CY_SYSPM_CHECK_READY, 0u);
        }

        /* The device (core) can switch into Low power mode only in condition
        *  that all executed registered callback functions with CY_SYSPM_CHECK_READY
        *  parameter returned CY_SYSPM_SUCCESS
        */
        if(retVal == CY_SYSPM_SUCCESS)
        {
            /* Call registered callback functions with CY_SYSPM_BEFORE_ENTER
            *  parameter. Return value is ignored.
            */
            interruptState = Cy_SysLib_EnterCriticalSection();
            if(0u != currentRegisteredCallbacksNumber)
            {
                (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_EXIT_LP_MODE, CY_SYSPM_BEFORE_ENTER, 0u);
            }

            /* Set normal operation mode for Linear Core regulator in condition
            *  that it is enabled
            */
            if(Cy_SysPm_LdoIsEnabled())
            {
                SRSS->PWR_CTL &= ((uint32_t)~(_VAL2FLD(SRSS_PWR_CTL_LINREG_LPMODE, 1u)));
            }

