ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
            /* Configure normal operating mode for POR/BOD circuits and for
            *  Bandgap Voltage and Current References.
            */
            SRSS->PWR_CTL &= ((uint32_t)~(_VAL2FLD(SRSS_PWR_CTL_PORBOD_LPMODE, 1u) |
                                          _VAL2FLD(SRSS_PWR_CTL_ACT_REF_DIS, 1u) |
                                          _VAL2FLD(SRSS_PWR_CTL_VREFBUF_LPMODE, 1u)));

            /* This wait time allows Active Reference to settle */
            Cy_SysLib_DelayUs(CY_SYSPM_PWR_LP_TO_ACTIVE_WAIT_BEFORE_US);

            while((0u == _FLD2VAL(SRSS_PWR_CTL_ACT_REF_OK, SRSS->PWR_CTL)) && (0u != timeOut))
            {
                timeOut--;
            }

            if(0u == timeOut)
            {
                retVal = CY_SYSPM_TIMEOUT;
            }

            /* Configure the normal operation mode */
            SRSS->PWR_CTL &= (uint32_t) (~_VAL2FLD(SRSS_PWR_CTL_BGREF_LPMODE, 1u));

            /* This wait time allows the settle Active Reference */
            Cy_SysLib_DelayUs(CY_SYSPM_PWR_LP_TO_ACTIVE_WAIT_AFTER_US);

            Cy_SysLib_ExitCriticalSection(interruptState);

            /* Call registered callback functions with CY_SYSPM_AFTER_EXIT
            *  parameter. Return value is ignored.
            */
            if(0u != currentRegisteredCallbacksNumber)
            {
                (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_EXIT_LP_MODE, CY_SYSPM_AFTER_EXIT, 0u);
            }
        }
        else
        {
            /* Execute callback functions with CY_SYSPM_CHECK_FAIL parameter to
            *  undo everything done in the CY_SYSPM_CHECK_READY callback. Return
            *  value is ignored.
            */
            (void) Cy_SysPm_ExecuteCallback(CY_SYSPM_EXIT_LP_MODE, CY_SYSPM_CHECK_FAIL, (uint32_t) retVal);
            retVal = CY_SYSPM_FAIL;
        }
    }
    else
    {
        /* Do nothing as device is already in active power mode. */
    }
    return retVal;
}


/*******************************************************************************
* Function Name: Cy_SysPm_SleepOnExit
****************************************************************************//**
*
* Set Sleep on the Exit mode.
*
* This API gives a possibility to keep the system in a sleep mode at all times
* and only wakeup to run a single interrupt and then immediately go back to
* sleep.
*
* \param
* enable true - enable Sleep on the Exit mode <br> false - disable
* Sleep on the Exit mode.
*
*******************************************************************************/
void Cy_SysPm_SleepOnExit(bool enable)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    if(enable)
    {
        /* Enable SleepOnExit mode */
        SCB->SCR |= _VAL2FLD(SCB_SCR_SLEEPONEXIT, 1u);
    }
    else
    {
        /* Disable SleepOnExit mode */
        SCB->SCR &= ((uint32_t) ~(_VAL2FLD(SCB_SCR_SLEEPONEXIT, 1u)));
    }
    Cy_SysLib_ExitCriticalSection(interruptState);
}

#if(0u != SRSS_SIMOBUCK_PRESENT)
    /*******************************************************************************
    * Function Name: Cy_SysPm_SwitchToSimoBuck
    ****************************************************************************//**
    *
    * Switch the power supply regulator to Single-Input Multiple Output (SIMO)
    * Buck regulator instead of Linear Regulator. The SIMO Buck core regulator
    * can supply Vccd with higher efficiency than the Linear core regulator (LDO)
    * under some conditions, such as high external supply voltages.
    *
    * Before change from LDO to SIMO buck ensure that:
    * * Circuit board has connected Vccbuck1 to Vccd and also populated the
    * necessary external components for SIMO Buck regulator, including an
    * inductor and a capacitor for each output.
    * Refer to the device TRM for more details.
    *
    * * Operating frequencies are reduced so it is within the static timing
    * closure limits at the new frequency.
    *
    * * Current consumption on the core is reduced to meet 0.9 V (nominal) output
    * voltage. The main reason is that while changing from LDO to SIMO Buck,
    * the switch happens on 0.9 V (nominal).
    *
    * * Appropriate Wait states values are set for Flash using the
    * Cy_SysLib_SetWaitStates() function. Refer to the System Library (syslib) driver
    * for more details.
    *
    * In general, use the next sequence to obtain SIMO Buck 0.9 V (nominal):
    * 1) Set appropriate wait states for ULP by calling
    * Cy_SysLib_SetWaitStates(true, hfClkFreqMz), where hfClkFreqMz -
    * desired frequency of HfClk0 in MHz.
    *
    * 2) Set 0.9 V (nominal) for LDO regulator.
    *
    * 3) Switch the regulators by calling the Cy_SysPm_SwitchToSimoBuck() function.
    *
    * To obtain SIMO Buck 1.1 V (nominal) use next sequence:
    * 1) Set appropriate wait states for ULP by calling
    * Cy_SysLib_SetWaitStates(true, hfClkFreqMz), where hfClkFreqMz -
    * desired frequency of HfClk0 in MHz
    *
    * 2) Set 0.9 V (nominal) for LDO regulator
    *
    * 3) Switch the regulators by calling the Cy_SysPm_SwitchToSimoBuck() function
    *
    * 4) Change SIMO Buck output voltage by calling the
    * Cy_SysPm_SimoBuckSetVoltage1(CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_1_1V)
    *
    * 5) Set appropriate wait states for LP by calling
    * Cy_SysLib_SetWaitStates(false, hfClkFreqMz), where hfClkFreqMz -
    * desired frequency of HfClk0 in MHz
    *
    * \warning System does not have a way to know when Vccd is settled at actual
    * 0.9 V or 1.1 V for transition, as this voltage depends on conditions
    * including load current. The firmware works with
    * nominal 0.9 V and 1.1 V voltages.
    *
    * \warning Please be aware that the Flash access time when core
    * output voltage is 0.9 V (nominal) is longer that using 1.1 V (nominal).
    * Therefore the clock to the Flash should be decreased. Use the
    * Cy_SysLib_SetWaitStates() function to set appropriate wait state values
    * for Flash. Call the Cy_SysLib_SetWaitStates() function before
    * Cy_SysPm_SwitchToSimoBuck() if you want to change voltage
    * into 0.9 V (nominal). Call the Cy_SysLib_SetWaitStates() function after
    * Cy_SysPm_SwitchToSimoBuck() if you change voltage from 0.9 V (nominal)
    * to 1.1 V (nominal).
    *
    * \warning There is no way to back to Linear Regulator after SIMO Buck
    * regulator supply core.
    *
    * In addition if 0.9 V (nominal) output is set, the Flash works
    * in Read only operation.
    *
    * If 1.1 V (nominal) output is set, the Flash works in Read and Write
    * operation and clock frequencies may be increased up to the static
    * timing closure limits for the new voltage.
    * Refer to the device TRM for more details.
    *
    * \note
    * Function is applicable for devices with SIMO Buck Regulator.
    *
    * Function does not have effect if SIMO Buck regulator is already enabled.
    *
    *******************************************************************************/
    void Cy_SysPm_SwitchToSimoBuck(void)
    {
        /* Check is the SIMO Buck regulator already enabled */
        if(!Cy_SysPm_SimoBuckIsEnabled())
        {
            /* Disable the DeepSleep, nWell, and Retention regulators */
            SRSS->PWR_CTL |= (_VAL2FLD(SRSS_PWR_CTL_DPSLP_REG_DIS, 1u) |
                              _VAL2FLD(SRSS_PWR_CTL_RET_REG_DIS, 1u) |
                              _VAL2FLD(SRSS_PWR_CTL_NWELL_REG_DIS, 1u));

            /* Configure SIMO Buck regulator */
            SRSS->PWR_BUCK_CTL = _CLR_SET_FLD32U((SRSS->PWR_BUCK_CTL),
                                                  SRSS_PWR_BUCK_CTL_BUCK_OUT1_SEL,
                                                 (uint32_t) CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V);

            SRSS->PWR_BUCK_CTL |= _VAL2FLD(SRSS_PWR_BUCK_CTL_BUCK_EN, 1u);
            SRSS->PWR_BUCK_CTL |= _VAL2FLD(SRSS_PWR_BUCK_CTL_BUCK_OUT1_EN, 1u);

            /* Wait for SIMO Buck is stable */
            Cy_SysLib_DelayUs(CY_SYSPM_SIMO_BUCK_CORE_SUPPLY_STABLE_US);

            /* Disable linear regulator LDO as Vbuckout1 and LDO are shorted */
            SRSS->PWR_CTL |= _VAL2FLD(SRSS_PWR_CTL_LINREG_DIS, 1u);
        }
    }


