ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckSetVoltage1
    ****************************************************************************//**
    *
    * Set the output 1 voltage for an SIMO Buck regulator that can supply cores.
    * This output can supply cores instead of the Linear regulator.
    *
    * When changing from a higher voltage to a lower voltage make sure that:
    * * Operating frequency is reduced so it is within the static timing closure
    * limits at the new frequency.
    *
    * * Appropriate Wait states values are set for Flash using the
    * Cy_SysLib_SetWaitStates() function. Refer to the System Library (syslib) driver
    * for more details.
    *
    * \warning Please be aware that the Flash access time when core
    * output voltage is 0.9 V (nominal) is longer that using 1.1 V (nominal).
    * Therefore, the clock to the Flash should be decreased.
    *
    * In addition if 0.9 V (nominal) output is set, the Flash works in
    * Read-only operation.
    *
    * When changing from a lower voltage to a higher voltage, make sure that
    * appropriate wait states values are set for Flash using the
    * Cy_SysLib_SetWaitStates() function. Refer to the System Library (syslib) driver
    * for more details.
    *
    * If 1.1 V (nominal) output is set, the Flash works in Read and Write
    * operations and clock frequency may now be increased up to the static
    * timing closure limits for the new voltage.
    *
    * \warning System does not have a way to know when Vccd is settled at actual
    * 0.9 V or 1.1 V for transition, as this voltage depends on conditions
    * including load current. The firmware works with nominal
    * 0.9 V and 1.1 V voltages.
    *
    * \param
    * voltage Desired output 1 regulator voltage (Vccbuck1).
    * See \ref cy_en_syspm_simo_buck_voltage1_t
    *
    *******************************************************************************/
    void Cy_SysPm_SimoBuckSetVoltage1(cy_en_syspm_simo_buck_voltage1_t voltage)
    {
        /* Check is the required voltage is equal to current voltage */
        if(voltage != Cy_SysPm_SimoBuckGetVoltage1())
        {
            /* Set analog signal bit for flash before voltage is changed
            * from 1.1V to 0.9V
            */
            if(CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_0_9V == voltage)
            {
                Cy_SysPm_SetVoltageBitForFlash(true);
            }

            /* The system may continue operating while the voltage on Vccd
            *  discharges to the new voltage. The time it takes to reach the
            *  new voltage depends on conditions, including the load current on
            *  Vccd and the external capacitor size.
            */
            SRSS->PWR_BUCK_CTL =
            _CLR_SET_FLD32U((SRSS->PWR_BUCK_CTL), SRSS_PWR_BUCK_CTL_BUCK_OUT1_SEL, (uint32_t) voltage);

            /* Delay for the supply to stabilize at the new voltage is required
            *  when changing from a lower voltage to a higher voltage.
            */
            if(CY_SYSPM_SIMO_BUCK_OUT1_VOLTAGE_1_1V == voltage)
            {
                Cy_SysLib_DelayUs(CY_SYSPM_SIMO_BUCK_IS_STABLE_US);

                /* Set analog signal bit for flash before voltage is changed
                 * from 0.9 V to 1.1 V.
                 */
                Cy_SysPm_SetVoltageBitForFlash(false);
            }
        }
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckGetVoltage1
    ****************************************************************************//**
    *
    * Get current nominal output 1 voltage (Vccbuck1) of the SIMO Buck regulator.
    *
    * \note The actual device output 1 voltage (Vccbuck1) can be different from the
    * actual voltage as actual voltage value depends on conditions including
    * load current.
    *
    * \note The actual device output 1 voltage (Vccbuck1) can be different from the
    * nominal voltage as actual voltage value depends on conditions including
    * load current.
    *
    * \return
    * Nominal output voltage 1 (Vccbuck1) of the SIMO Buck regulator.
    * See \ref cy_en_syspm_simo_buck_voltage1_t.
    *
    *******************************************************************************/
    cy_en_syspm_simo_buck_voltage1_t Cy_SysPm_SimoBuckGetVoltage1(void)
    {
        uint32_t retVal;
        retVal = _FLD2VAL(SRSS_PWR_BUCK_CTL_BUCK_OUT1_SEL, SRSS->PWR_BUCK_CTL);

        return((cy_en_syspm_simo_buck_voltage1_t) retVal);
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_EnableVoltage2
    ****************************************************************************//**
    *
    * Enable output 2 voltage (Vbuckrf) of the SIMO Buck regulator. The output 2
    * voltage (Vbuckrf) of the SIMO Buck regulator is used to supply the BLE HW block.
    *
    * The SIMO Buck regulator should be enabled before the Cy_SysPm_EnableVoltage2()
    * function call.
    *
    * \note The function does not have effect if SIMO Buck regulator is disabled.
    *
    *******************************************************************************/
    void Cy_SysPm_EnableVoltage2(void)
    {
        if(!Cy_SysPm_SimoBuckIsEnabled())
        {
            /* Enable SIMO Buck output 2 */
            SRSS->PWR_BUCK_CTL2 |= _VAL2FLD(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_EN, 1u);

            /* Wait until output is stable */
            Cy_SysLib_DelayUs(CY_SYSPM_SIMO_BUCK_BLE_SUPPLY_STABLE_US);
        }
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_EnableVoltage2
    ****************************************************************************//**
    *
    * Disable output 2 voltage (Vbuckrf) of the SIMO Buck regulator. The output 2
    * voltage (Vbuckrf) of the SIMO Buck regulator is used to supply the BLE HW block.
    *
    *******************************************************************************/
    void Cy_SysPm_DisableVoltage2(void)
    {
        /* Disable Vbuck2 output */
        SRSS->PWR_BUCK_CTL2 &= ((uint32_t) ~ (_VAL2FLD(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_EN, 1u)));
    }


