ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckSetVoltage2
    ****************************************************************************//**
    *
    * Set current voltage 2 voltage of the SIMO Buck regulator.
    *
    * \param
    * voltage voltage of Linear regulator.
    * See \ref cy_en_syspm_simo_buck_voltage2_t.
    *
    *******************************************************************************/
    void Cy_SysPm_SimoBuckSetVoltage2(cy_en_syspm_simo_buck_voltage2_t voltage)
    {
        if(voltage != Cy_SysPm_SimoBuckGetVoltage2())
        {
            SRSS->PWR_BUCK_CTL2 =
            _CLR_SET_FLD32U((SRSS->PWR_BUCK_CTL2), SRSS_PWR_BUCK_CTL2_BUCK_OUT2_SEL, (uint32_t) voltage);

            Cy_SysLib_DelayUs(CY_SYSPM_SIMO_BUCK_IS_STABLE_US);
        }

    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckGetVoltage2
    ****************************************************************************//**
    *
    * Get current output 2 voltage (Vbuckrf) of the SIMO Buck regulator.
    *
    * \note The actual device output 2 voltage (Vbuckrf) can be different from the
    * nominal voltage as actual voltage value depends on conditions including
    * load current.
    *
    * \return
    * Nominal output voltage of the SIMO Buck regulator output 2 voltage (Vbuckrf).
    * See \ref cy_en_syspm_simo_buck_voltage2_t.
    *
    *******************************************************************************/
    cy_en_syspm_simo_buck_voltage2_t Cy_SysPm_SimoBuckGetVoltage2(void)
    {
        uint32_t retVal;
        retVal = _FLD2VAL(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_SEL, SRSS->PWR_BUCK_CTL2);

        return((cy_en_syspm_simo_buck_voltage2_t) retVal);
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckOutputIsEnabled
    ****************************************************************************//**
    *
    * Get current output status of the SIMO Buck outputs.
    *
    * \param
    * output SIMO Buck regulator output. See \ref cy_en_syspm_buck_out_t.
    *
    * \return
    * current state of requested output. True if requested output is enabled.
    * False if requested output is disabled.
    *
    *******************************************************************************/
    bool Cy_SysPm_SimoBuckOutputIsEnabled(cy_en_syspm_buck_out_t output)
    {
        bool retVal;
        if(output == CY_SYSPM_BUCK_VBUCK_1)
        {
            retVal = ((0u != _FLD2VAL(SRSS_PWR_BUCK_CTL_BUCK_OUT1_EN, SRSS->PWR_BUCK_CTL)) ? true : false);
        }
        else
        {
            if((0u != _FLD2VAL(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL, SRSS->PWR_BUCK_CTL2)) ||
               (0u != _FLD2VAL(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_EN, SRSS->PWR_BUCK_CTL2)))
            {
                retVal = true;
            }
            else
            {
                retVal = false;
            }
        }
        return(retVal);
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckIsEnabled
    ****************************************************************************//**
    *
    * Get current status of SIMO Buck regulator.
    *
    * \return
    * current state of the SIMO Buck regulator. True if SIMO Buck regulator is enabled,
    * false if it is disabled
    *
    *******************************************************************************/
    bool Cy_SysPm_SimoBuckIsEnabled(void)
    {
        return((0u !=_FLD2VAL(SRSS_PWR_BUCK_CTL_BUCK_EN, SRSS->PWR_BUCK_CTL)) ? true : false);
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckSetHwControl
    ****************************************************************************//**
    *
    * Set hardware control for SIMO Buck output 2 (Vbuckrf)
    *
    * Hardware control for Vbuckrf output. When this bit is set, the value in
    * BUCK_OUT2_EN is ignored and a hardware signal is used instead. If the
    * product has supporting hardware, it can directly control the enable signal
    * for Vbuckrf.
    *
    * \param
    * output enable/disable SIMO Buck regulator outputs,
    * see \ref cy_en_syspm_buck_out.
    *
    *******************************************************************************/
    void Cy_SysPm_SimoBuckSetHwControl(bool hwControl)
    {
        if(hwControl)
        {
            SRSS->PWR_BUCK_CTL2 |= _VAL2FLD(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL, 1u);
        }
        else
        {
            SRSS->PWR_BUCK_CTL2 &= ((uint32_t)~(_VAL2FLD(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL, 1u)));
        }
    }


    /*******************************************************************************
    * Function Name: Cy_SysPm_SimoBuckGetHwControl
    ****************************************************************************//**
    *
    * Get hardware control for Vbuckrf
    *
    * Hardware control for Vbuckrf output. When this bit is set, the value in
    * BUCK_OUT2_EN is ignored and a hardware signal is used instead.  If the
    * product has supporting hardware, it can directly control the enable signal
    * for Vbuckrf.
    *
    * \return
    * true if HW control is set, false if FW control is set for SIMO Buck output 2
    *
    *******************************************************************************/
    bool Cy_SysPm_SimoBuckGetHwControl(void)
    {
        return((0u != _FLD2VAL(SRSS_PWR_BUCK_CTL2_BUCK_OUT2_HW_SEL, SRSS->PWR_BUCK_CTL2)) ? true : false);
    }

#endif /* (0u != SRSS_SIMOBUCK_PRESENT) */


/*******************************************************************************
* Function Name: Cy_SysPm_LdoSetVoltage
****************************************************************************//**
*
* Set the voltage on linear regulator (LDO).
* When changing from a higher voltage to a lower voltage make sure that:
* * Operating frequencies are reduced so these are within the static timing
* closure limits at the new frequency.
*
* * Current consumption on core is reduced to meet new output voltage.
*
* * Appropriate Wait states values are set for Flash using the
* Cy_SysLib_SetWaitStates() function. Refer to the System Library (syslib) driver
* for more details.
*
* \warning Please be aware that the Flash access time in condition that core
* output voltage is 0.9 V (nominal) is longer that using 1.1 V (nominal).
* Therefore the clock to the Flash should be decreased.
*
* In addition if 0.9 V (nominal) output is set, the Flash works in Read
* only operation.
*
* When changing from a lower voltage to a higher voltage make sure that
* appropriate Wait states values is set for Flash using the
* Cy_SysLib_SetWaitStates() function. Refer to System Library (syslib) driver
* for more details.
*
* If 1.1 V (nominal) output is set, the Flash works in Read and Write
* operations. Clock frequency may now be increased up to the static
* timing closure limits for the new voltage.
*
* \note The actual device Vccd voltage can be different from the
* nominal voltage as actual voltage value depends on conditions including
* load current.
*
* \param
* voltage Desired output regulator voltage.
* See \ref cy_en_syspm_ldo_voltage_t voltage
*
*******************************************************************************/
void Cy_SysPm_LdoSetVoltage(cy_en_syspm_ldo_voltage_t voltage)
{
    if(voltage != Cy_SysPm_LdoGetVoltage())
    {
        /* Set analog signal bit for flash before voltage is changed
        * from 1.1V to 0.9V
        */
        if(CY_SYSPM_LDO_VOLTAGE_0_9V == voltage)
        {
            Cy_SysPm_SetVoltageBitForFlash(true);
        }

        /* The system may continue operating while the voltage on Vccd
        *  discharges to the new voltage. The time it takes to reach the
        *  new voltage depends on conditions, including the load current on
        *  Vccd and the external capacitor size
        */
        SRSS->PWR_TRIM_PWRSYS_CTL =
        _CLR_SET_FLD32U((SRSS->PWR_TRIM_PWRSYS_CTL), SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM, voltage);

        if(CY_SYSPM_LDO_VOLTAGE_1_1V == voltage)
        {
            /* Delay for the supply to stabilize at the new higher voltage */
            Cy_SysLib_DelayUs(CY_SYSPM_LDO_IS_STABLE_US);

            /* Set analog signal bit to flash macro register after output voltage is 1.1 V */
            Cy_SysPm_SetVoltageBitForFlash(false);
        }
    }
}


