ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
/*******************************************************************************
* Function Name: Cy_SysPm_LdoGetVoltage
****************************************************************************//**
*
* Get current output voltage value of Linear regulator.
*
* \note The actual device Vccd voltage can be different from the
* nominal voltage as actual voltage value depends on conditions including
* load current.
*
* \return
* Nominal output voltage of the Linear regulator.
* See \ref cy_en_syspm_ldo_voltage_t.
*
*******************************************************************************/
cy_en_syspm_ldo_voltage_t Cy_SysPm_LdoGetVoltage(void)
{
    uint32_t retVal;
    retVal = _FLD2VAL(SRSS_PWR_TRIM_PWRSYS_CTL_ACT_REG_TRIM, SRSS->PWR_TRIM_PWRSYS_CTL);

    return((cy_en_syspm_ldo_voltage_t) retVal);
}


/*******************************************************************************
* Function Name: Cy_SysPm_LdoIsEnabled
****************************************************************************//**
*
* Read the current status of Linear regulator.
*
* \return
* True means the Linear regulator is enabled. False means it is if disabled
*
*******************************************************************************/
bool Cy_SysPm_LdoIsEnabled(void)
{
    return((0u != _FLD2VAL(SRSS_PWR_CTL_LINREG_DIS, SRSS->PWR_CTL)) ? false : true);
}


/*******************************************************************************
* Function Name: Cy_SysPm_WakeupPinLevel
****************************************************************************//**
*
* This function enables/disables wakeup pins and configure their active
* (high or low) level.
*
* A wake up from the Hibernate mode can be performed by toggling the wakeup pins,
* causing a normal boot procedure to occur. A wakeup is supported by up to
* two pins with programmable polarity. These pins may be connected to IO pins
* or on-chip peripherals under some conditions.
* Setting the wakeup pin to this level will cause a wakeup from the Hibernate
* mode. The wakeup pins are active-low by default.
*
* Configure only one pin at one API call.
*
* \param
* pinNum Selects the wakeup pin. The valid range is [0-1]. The number of the pin.
*
* \param enPinLevel Selects polarity. See \ref cy_en_syspm_pinstate_t.
*
* pinNum value corresponds to an appropriate pin. For example, value 1
* corresponds to second wakeup pin. For information about wakeup pin
* assignment in specific families devices, refer to the appropriate device
* TRM.
*
*******************************************************************************/
void Cy_SysPm_WakeupPinLevel(uint32_t pinNum, cy_en_syspm_pinstate_t enPinLevel)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    pinNum &= CY_SYSPM_PWR_MASK_HIBPIN_PIN_MASK;

    if (CY_SYSPM_PIN_HIGH_LEVEL == enPinLevel)
    {
        /* Set high level of selected wakeup pin */
        SRSS->PWR_HIBERNATE |=
        _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, (CY_SYSPM_WAKEUP_PIN_BIT << pinNum)) |
        _VAL2FLD(SRSS_PWR_HIBERNATE_POLARITY_HIBPIN, (CY_SYSPM_WAKEUP_PIN_BIT << pinNum));
    }
    else if(CY_SYSPM_PIN_LOW_LEVEL == enPinLevel)
    {
        /* Set low level of selected wakeup pin */
        SRSS->PWR_HIBERNATE |=
        _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, (CY_SYSPM_WAKEUP_PIN_BIT << pinNum));

        SRSS->PWR_HIBERNATE &=
        ((uint32_t) ~_VAL2FLD(SRSS_PWR_HIBERNATE_POLARITY_HIBPIN, (CY_SYSPM_WAKEUP_PIN_BIT << pinNum)));
    }
    else
    {
        /* Disable selected wakeup pin */
        SRSS->PWR_HIBERNATE &=
        ((uint32_t) ~_VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, (CY_SYSPM_WAKEUP_PIN_BIT << pinNum)));
    }
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysPm_WakeupLpCompLevel
****************************************************************************//**
*
* This function is configure wakeup low-power comparators (LPComp) and
* assigns their active (high or low) level.
*
* A wake up from the Hibernate mode can be performed by toggling the LPComps,
* causing a normal boot procedure to occur. A wakeup is supported by up to
* two LPComps with programmable polarity. These LPComp may be connected to IO
* pins or on-chip peripherals under some conditions.
* Setting the LPComp to this level will cause a wakeup from the Hibernate
* mode. The wakeup LPComp are active-low by default.
*
* Configure one of the LPComps at one API call.
*
* \note The Low-power comparators should be configured and enabled before
* switching into the Hibernate low power mode. Refer to LPComp
* driver description for more details.
*
* \param
* lpCompNum Selects the LPComp. The valid range is [0-1]. The number of the LPComp.
*
* \param enLpCompLevel Selects polarity. See \ref cy_en_syspm_lpcomp_state_t.
*
* lpCompNum value corresponds to an appropriate LPComp. For example, value 1
* corresponds to second LP Comparator. For information about wakeup LPComp
* assignment in specific families devices, refer to the appropriate device
* TRM.
*
*******************************************************************************/
void Cy_SysPm_WakeupLpCompLevel(uint32_t lpCompNum, cy_en_syspm_lpcomp_state_t enLpCompLevel)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    lpCompNum &= CY_SYSPM_LPCOMPARATOR_MASK;

    if(CY_SYSPM_LPCOMP_HIGH_LEVEL == enLpCompLevel)
    {
        /* Set high level of selected wakeup pin */
        SRSS->PWR_HIBERNATE |=
        _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, CY_SYSPM_LPCOMPARATOR_BIT << lpCompNum) |
        _VAL2FLD(SRSS_PWR_HIBERNATE_POLARITY_HIBPIN, (CY_SYSPM_LPCOMPARATOR_BIT << lpCompNum));
    }
    else if(CY_SYSPM_LPCOMP_LOW_LEVEL == enLpCompLevel)
    {
        /* Set low level of selected wakeup pin */
        SRSS->PWR_HIBERNATE |=
        _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, (CY_SYSPM_LPCOMPARATOR_BIT << lpCompNum));

