ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
        SRSS->PWR_HIBERNATE &=
        ((uint32_t) ~_VAL2FLD(SRSS_PWR_HIBERNATE_POLARITY_HIBPIN, (CY_SYSPM_LPCOMPARATOR_BIT << lpCompNum)));
    }
    else
    {
        /* Disable selected wakeup pin */
        SRSS->PWR_HIBERNATE &=
        ((uint32_t) ~_VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBPIN, (CY_SYSPM_LPCOMPARATOR_BIT << lpCompNum)));
    }
    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysPm_WakeupWdt
****************************************************************************//**
*
* This function enables/disables the Watchdog (WDT) to wake up the device from
* Hibernate power mode after WDT interrupt.
*
* \note The WDT should be configured and enabled before entering into Hibernate
* power mode.
*
* A wakeup from the Hibernate mode can be performed by the Watchdog interrupt,
* causing a normal boot procedure to occur.
* The wakeup is performed by a WDT interrupt and a normal boot procedure
* after device reset. Device can wake up from Hibernate after WDT device reset,
* if WDT was not configured to wake up the device on its interrupt and WDT
* was enabled.
* Refer to Watchdog Timer (WDT) driver description for more details.
*
* \param
* configureWdt true if WDT interrupt should wake up device from Hibernate and <br>
* false if WDT interrupt should not wake up device from Hibernate.
*
*******************************************************************************/
void Cy_SysPm_WakeupWdt(bool configureWdt)
{
    if(configureWdt)
    {
        SRSS->PWR_HIBERNATE |= _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBWDT, 1u);
    }
    else
    {
        SRSS->PWR_HIBERNATE &= ((uint32_t) (~_VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBWDT, 1u)));
    }
}


/*******************************************************************************
* Function Name: Cy_SysPm_WakeupRtc
****************************************************************************//**
*
* This function enables/disables the alarms from RTC to wake up the device from
* Hibernate power mode after RTC alarm assert.
*
* \note The RTC alarm should be configured and enabled before entering into
* Hibernate power mode.
*
* A wakeup from the Hibernate mode can be performed by the RTC alarm,
* causing a normal boot procedure to occur.
* The wakeup is performed by the RTC alarm and a normal boot procedure
* after device reset.
* Refer to Real-Time Clock (RTC) driver description for more details.
*
* \param
* configureRtc true if RTC alarm should wake up device from Hibernate <br>
* false if RTC alarm should not wake up device from Hibernate
*
*******************************************************************************/
void Cy_SysPm_WakeupRtc(bool configureRtc)
{
    if(configureRtc)
    {
        SRSS->PWR_HIBERNATE |= _VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBALARM, 1u);
    }
    else
    {
        SRSS->PWR_HIBERNATE &= ((uint32_t) ~_VAL2FLD(SRSS_PWR_HIBERNATE_MASK_HIBALARM, 1u));
    }
}



/*******************************************************************************
* Function Name: Cy_SysPm_RegisterCallback
****************************************************************************//**
*
* Registers a new syspm callback.
*
* \note The registered callbacks will be executed in order of how callbacks were
* registered: the first registered callback will be always the first executed. And the
* last registered callback will be executed as the last callback.
*
* A callback is a function called after an event in a driver or
* middleware-module has occurred. The handler callback API will be executed if
* specific event occurs. See \ref cy_stc_syspm_callback_t.
*
* \param
* handler syspm callback structure. See \ref cy_stc_syspm_callback_t.
*
* \return
* True: callback was registered; <br>
* False: callback was not registered.
*
* It is allowed to register up to 32 callbacks.
*
*******************************************************************************/
bool Cy_SysPm_RegisterCallback(cy_stc_syspm_callback_t* handler)
{
    uint32_t interruptState;
    volatile bool regCallbackReturnValue = true;
    cy_stc_syspm_callback_t* currentCallback = callbackRoot;

    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check if the maximum callbacks were registered */
    if((CY_SYSPM_PWR_MAX_CALLBACKS_NUMBER > currentRegisteredCallbacksNumber) &&
    (handler->Callback != NULL))
    {
        /* Check if was at least one callback registered */
        if(callbackRoot == NULL)
        {
            callbackRoot = handler;
            handler->nextItm = NULL;

            currentRegisteredCallbacksNumber++;
        }
        else
        {
            /* Check was the required callback already registered */
            while(regCallbackReturnValue && (currentCallback->nextItm != NULL))
            {
                if((currentCallback == handler) && (currentCallback->base == handler->base))
                {
                    /* Condition to switch-off from checking loop and return false as requested callback is
                    * already registered
                    */
                    regCallbackReturnValue = false;
                }

                currentCallback = currentCallback->nextItm;
            }

            /* Check last element of callback list */
            if((currentCallback == handler) && (currentCallback->base == handler->base))
            {
                /* Condition to switch of from checking and return false */
                regCallbackReturnValue = false;
            }

            if(false != regCallbackReturnValue)
            {
                /* Condition when last registered callback was found */
                currentCallback->nextItm = handler;
                handler->nextItm = NULL;

                currentRegisteredCallbacksNumber++;
            }
        }
    }
    else
    {
        regCallbackReturnValue = false;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return(regCallbackReturnValue);
}


