ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
/*******************************************************************************
* Function Name: Cy_SysPm_UnregisterCallback
****************************************************************************//**
*
* Unregister a callback.
*
* The registered callback can be unregistered. Otherwise, false will be
* returned.
*
* \param
* handler the list item and callback handler. See
* \ref cy_stc_syspm_callback_t.
*
* \return
* True: on success <br>
* False: if it was not unregistered.
*
*******************************************************************************/
bool Cy_SysPm_UnregisterCallback(cy_stc_syspm_callback_t* handler)
{
    uint32_t interruptState;
    volatile bool unRegCallbackValue;
    volatile bool unRegCallbackCheckStatus;

    cy_stc_syspm_callback_t* currentCallback = callbackRoot;
    cy_stc_syspm_callback_t* nextCallback;

    unRegCallbackCheckStatus = true;

    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check if was at least one callback registered */
    if(0u != currentRegisteredCallbacksNumber)
    {
        if((callbackRoot == handler) && (callbackRoot->base == handler->base))
        {
            callbackRoot = callbackRoot->nextItm;
            unRegCallbackCheckStatus = false;
            unRegCallbackValue = true;
            currentRegisteredCallbacksNumber--;
        }

        while(unRegCallbackCheckStatus && (currentCallback != NULL))
        {
            /* Searching callback by handler */
            if(currentCallback->nextItm == handler)
            {
                nextCallback = currentCallback->nextItm;

                /* Check is it required callback by it address */
                if((nextCallback->base == handler->base) && (currentCallback->nextItm == handler))
                {
                    currentCallback->nextItm = handler->nextItm;
                    unRegCallbackCheckStatus = false;
                    unRegCallbackValue = true;
                    currentRegisteredCallbacksNumber--;
                }
            }
            else
            {
                unRegCallbackValue = false;
            }
            currentCallback = currentCallback->nextItm;
        }
    }
    else
    {
        unRegCallbackValue = false;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);

    return(unRegCallbackValue);
}


/*******************************************************************************
* Function Name: Cy_SysPm_ExecuteCallback
****************************************************************************//**
*
* Internal API that executes all registered callbacks with type.
* \note The registered callbacks will be executed in order of how callbacks were
* registered: the first registered callback will be first executed. And the
* last registered callback will be executed as the last callback.
*
* Executed callbacks in the registered callback list from index 0 to index
* lastCallback-1. If lastCallback = 0 then all callbacks are executed. Callbacks
* are executed until the first one that returns CY_SYSPM_FAIL. Returns the
* index+1 of the callback that failed. If no callbacks are registered, returns
* CY_SYSPM_SUCCESS.
*
* \param
* type callback type. See \ref cy_en_syspm_callback_type_t.
*
* \param
* mode callback mode. See \ref cy_en_syspm_callback_mode_t.
*
* \param
* lastCallback Index+1 of last registered callback to execute.
* if lastCallback = 0 - Execute all registered callbacks
*
* \return
* CY_SYSPM_SUCCESS Callback successfully completed or nor callbacks registered.
* Something different than CY_SYSPM_SUCCESS - Index+1 of callback that failed.
*
*******************************************************************************/
uint32_t Cy_SysPm_ExecuteCallback(cy_en_syspm_callback_type_t type,
                                  cy_en_syspm_callback_mode_t mode,
                                  uint32_t lastCallback)
{
    uint32_t executedCallbacksCounter = 0u;
    uint32_t retVal = (uint32_t) CY_SYSPM_SUCCESS;
    cy_stc_syspm_callback_t* currentCallback = callbackRoot;

    if(0u == lastCallback)
    {
        lastCallback = CY_SYSPM_PWR_MAX_CALLBACKS_NUMBER;
    }

    while((currentCallback != NULL) && (retVal != ((uint32_t) CY_SYSPM_FAIL)) && (0u != lastCallback))
    {
        if (currentCallback->type == type)
        {
            retVal = (uint32_t) currentCallback->Callback(currentCallback->base, currentCallback->content, mode);
            executedCallbacksCounter++;
            lastCallback--;
        }
        currentCallback = currentCallback->nextItm;
    }

    /* Return Index+1 of callback that failed if callback function returned
    *  CY_SYSPM_FAIL
    */
    if(retVal == (uint32_t) CY_SYSPM_FAIL)
    {
        retVal = executedCallbacksCounter;
    }
    return retVal;
}


/*******************************************************************************
* Function Name: Cy_SysPm_GetIoFreezeStatus
****************************************************************************//**
*
* Checks whether IoFreeze is enabled.
*
* \return Returns TRUE if IOs are frozen <br> FALSE if IOs are unfrozen.
*
******************************************************************************/
bool Cy_SysPm_GetIoFreezeStatus(void)
{
    return(0u != _FLD2VAL(SRSS_PWR_HIBERNATE_FREEZE, SRSS->PWR_HIBERNATE));
}


/*******************************************************************************
* Function Name: Cy_SysPm_IoFreeze
****************************************************************************//**
*
* Freezes IOs.
*
* Freezes IO-Cells directly to save the IO-Cell state on a wakeup from the
* Hibernate. You don't need to call this function before entering the
* Hibernate mode, because Cy_SysPm_Hibernate() function freezes IO-Cells
* implicitly.
*
******************************************************************************/
void Cy_SysPm_IoFreeze(void)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Check the FREEZE state to avoid recurrent IO-Cells freeze attempt,
    * because the second call to this function will cause an accidental switch
    * to the Hibernate mode (the system will enter Hibernate mode immediately
    * after writing to Hibernate bit because both UNLOCK and FREEZE were set
    * correctly in previous call to this function).
    */
    if(0u == _FLD2VAL(SRSS_PWR_HIBERNATE_FREEZE, SRSS->PWR_HIBERNATE))
    {
        /* Clear unlock field for correct freeze of IO-Cells */
        SRSS->PWR_HIBERNATE = _CLR_SET_FLD32U((SRSS->PWR_HIBERNATE), SRSS_PWR_HIBERNATE_UNLOCK, 0u);

        /* Preserve last-reset reason and disable overriding by peripherals next
        *  pin-freeze command
        */
        SRSS->PWR_HIBERNATE |=  CY_SYSPM_PWR_HIBERNATE_UNLOCK |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_FREEZE, 1u) |
                                _VAL2FLD(SRSS_PWR_HIBERNATE_HIBERNATE, 1u);

        /* If reading after writing, read this register three times to delay
        *  enough time for internal settling.
        */
        (void) SRSS->PWR_HIBERNATE;
        (void) SRSS->PWR_HIBERNATE;

        /* Second write causes freeze of IO-Cells to save IO-Cell state */
        SRSS->PWR_HIBERNATE = SRSS->PWR_HIBERNATE;
    }
    Cy_SysLib_ExitCriticalSection(interruptState);
}


