ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/driver_periph/syspm/cy_syspm.c
/*******************************************************************************
* Function Name: Cy_SysPm_IoUnfreeze
****************************************************************************//**
*
* Unfreezes the IOs.
*
* The IO-Cells remain frozen after awaking from the Hibernate mode until the
* firmware unfreezes them after booting. The call of this function unfreezes the
* IO-Cells explicitly.
*
* If the firmware intent is to retain the data value on the port, then the
* value must be read and re-written to the data register before calling this
* API. Furthermore, the drive mode must be re-programmed. If this is not done,
* the pin state will change to default state the moment the freeze is removed.
*
*******************************************************************************/
void Cy_SysPm_IoUnfreeze(void)
{
    uint32_t interruptState;
    interruptState = Cy_SysLib_EnterCriticalSection();

    /* Preserve last reset reason and wakeup polarity. Then, unfreeze I/O:
     * write PWR_HIBERNATE.FREEZE=0, .UNLOCK=0x3A, .HIBERANTE=0,
     */
    SRSS->PWR_HIBERNATE =
    CY_SYSPM_PWR_HIBERNATE_UNLOCK | (SRSS->PWR_HIBERNATE & CY_SYSPM_PWR_RETAIN_HIBERNATE_STATUS);

    /* If reading stands after writing, read this register three times to delay
    *  enough time for internal settling.
    */
    (void) SRSS->PWR_HIBERNATE;
    (void) SRSS->PWR_HIBERNATE;

    /* Lock HIBERNATE mode: write PWR_HIBERNATE.HIBERNATE=0, UNLOCK=0x00, HIBERANTE=0, .TOKEN */
    SRSS->PWR_HIBERNATE &= CY_SYSPM_PWR_RETAIN_HIBERNATE_STATUS;

    Cy_SysLib_ExitCriticalSection(interruptState);
}


/*******************************************************************************
* Function Name: Cy_SysPm_SetDelayAfterDeepSleep
****************************************************************************//**
*
* \Internal function for setting the delay after switching the device from
* DeepSleep power mode.
*
* If ECO or PLL is enabled, the 17 us delay should be
* configured before entering into the DeepSleep. If ECO or PLL are
* disabled, the delay is not required.
*
*******************************************************************************/
static void Cy_SysPm_SetDelayAfterDeepSleep(void)
{
    uint32_t clkPath = 0u;
    uint32_t waitClocks = 0u;

    if (_FLD2VAL(SRSS_CLK_ECO_CONFIG_ECO_EN, SRSS->CLK_ECO_CONFIG) == 0u)
    {
        while((CY_SYSPM_PWR_MAX_PLL_NUMBER > clkPath) && (CY_SYSPM_PWR_TRIM_WAKE_CNTS != waitClocks))
        {
            if(_FLD2VAL(SRSS_CLK_PLL_CONFIG_ENABLE, SRSS->CLK_PLL_CONFIG[clkPath]) != 0u)
            {
               waitClocks = CY_SYSPM_PWR_TRIM_WAKE_CNTS;
            }
            clkPath++;
        }
    }
    else
    {
        waitClocks = CY_SYSPM_PWR_TRIM_WAKE_CNTS;
    }

    if(0u != waitClocks)
    {
        SRSS->PWR_TRIM_WAKE_CTL =
        _CLR_SET_FLD32U((SRSS->PWR_TRIM_WAKE_CTL), SRSS_PWR_TRIM_WAKE_CTL_WAKE_DELAY, waitClocks);
    }
}


/*******************************************************************************
* Function Name: Cy_SysPm_SetVoltageBitForFlash
****************************************************************************//**
*
* Internal function that changes the Vcc setting for flash.
*
* \param
* setBit set/clear bit for flash macro register. This bit should be set when
* voltage for core regulators is less than 0.99 V. This bit should be set if
* output voltage for core regulators is higher than 0.99 V.
*
*
*******************************************************************************/
static void Cy_SysPm_SetVoltageBitForFlash(bool setBit)
{
    if(setBit)
    {
        FLASHC_FM_CTL->ANA_CTL0 |= _VAL2FLD(FLASHC_FM_CTL_ANA_CTL0_VCC_SEL, 1u);
    }
    else
    {
        FLASHC_FM_CTL->ANA_CTL0 &= ((uint32_t) (~_VAL2FLD(FLASHC_FM_CTL_ANA_CTL0_VCC_SEL, 1u)));
    }
}


/* [] END OF FILE */
